Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Boyfriend Makeover.tmx
Source language: ko_kr
Languages: en_us

source: 어머, 도와주긴~ 이건 협업이지, 협업!
en_us: oh, no. they aren’t helping! this is a collab!

source: 김민하(16) 민호 여동생
en_us: minha kim, 16 years old minho’s younger sister

source: 찰칵~
en_us: SNAP

source: 미미쨩이라니!!
en_us: she isn’t mimi-chan!

source: 고
en_us: Z

source: 우리 집은 사실 조금 삭막하잖아~ 부럽다!
en_us: I’m envious! honestly, my place is dead quiet.

source: 첫 번째, 색조화장
en_us: first, makeup.

source: 그건 아직 생각 안 해봤지만 프로젝트가 확정되면 그때부터 계획을 짜봐야겠지...?
en_us: we haven’t thought that far yet. when the project is confirmed, we’ll have to plan the details...

source: 시아야...
en_us: sia...

source: 치팅데이 없다고, 이 돼지야!!!!
en_us: you can’t have a cheating day, you pig!!!!

source: *서킷트레이닝:
en_us: *circuit training:

source: 시아쨩이 큐브몬스터 극장판을!?!?!?
en_us: watch the cube monster movie... with sia-chan?!!!

source: 20화
en_us: Episode 20

source: 급성장기랄까나...?
en_us: you can say it was a sudden growth spurt.

source: 저기 혹시…
en_us: excuse me...

source: 그나저나 김민호 이자식…
en_us: at any rate, that darn minho...

source: 그 중에서도 제일 개 쩌는 건...
en_us: my absolute fave is the channel with...

source: 쿵!
en_us: THUD

source: 슈크림의 부드러운 맛이랑 팥의 꾸덕했던 그 맛이 그리워…!!!
en_us: I miss the taste of smooth choux cream and grainy red bean paste!!!

source: 로스 P
en_us: OSS F

source: 그래 그래, 이제 어서 네 반에 가서 공부 해.
en_us: okay, okay. now go back to your classroom and study.

source: sia**** 안녕하세요 윤시아입니다.
en_us: sia**** Hello, everyone.

source: 얘네들...
en_us: these two...

source: 꾸욱
en_us: PRESS

source: 그래서 다들...
en_us: no wonder...

source: 시아야!!!
en_us: sia!!!

source: 이게 요즘 아이돌 노래구나…
en_us: so this is what recent girl group songs are like...

source: 우리 몸에는 항상성이란 게 있어서 항상 똑같은 상태를 유지하려고 하거든.
en_us: our bodies always try to maintain something called homeostasis, or a consistent state.

source: 인싸력 만렙이잖아!!!!!
en_us: she’s super popular! part of the in-crowd!!!!

source: 윤시아 Sia Yo
en_us: Sia Yoon

source: 편의점
en_us: CONVENIENCE

source: 귀찮아지기 전에 자리를 떠보실까...
en_us: I should leave before things get any worse...

source: 외롭고 힘들 땐
en_us: when you feel lonely and down!

source: 하, 한 달?
en_us: a-a month?

source: 그러게...
en_us: yeah...

source: 시아쨩은 쉬고 있으면 된다구!
en_us: you can just rest, sia-chan!

source: 이게 가능해...?
en_us: is this even possible?

source: 그런데 혹시...
en_us: anyway...

source: 김민호는 괜찮겠지 뭐…
en_us: I’m sure minho will be fine...

source: 그렇긴 한데...
en_us: you’re right...

source: 무엇보다...
en_us: and more importantly...

source: 숨이 턱 끝까지 차오른다…!!
en_us: I’m so out of breath!!!

source: 5kg은 거뜬히 빠져있겠지?
en_us: still, he should be ten pounds lighter, right?

source: 그래서 함께 있으면 편안한 기분이 든다.
en_us: I feel comfortable when I’m with him.

source: 콘텍트
en_us: CONTACT

source: 지금까지 해온 게 얼만데!
en_us: I can’t let all that time and effort go to waste!

source: 보배
en_us: Bobae

source: 많이 기다렸어?
en_us: did you wait a while?

source: 스키장 가자고~
en_us: ...let’s go skiing!

source: 왜, 왜지?
en_us: wh-why?

source: 그건 2D덕후가 3D덕후로 넘어가는 자연스러운 현상이니까.
en_us: you’re going through a very natural process of moving from stanning a 2d character to stanning a 3d character.

source: 뭐...
en_us: well...

source: 같이 연남동 갈래?
en_us: ...want to go to yeonnamdong together?

source: 그래서 새 남자친구는 어디에...
en_us: so... where’s ur new boyfriend???

source: 매일 밤마다 몰래 먹다가 걸렸거든...
en_us: he got caught eating at night too...

source: 생글 생글
en_us: BEAM BEAM

source: 김민호는 코찔찔이래요~
en_us: minho kim’s a snot-face!

source: 그런 건 아니고...
en_us: no...

source: 안 맞은 옷을 입은 느낌…
en_us: like you wore something that doesn’t suit you...

source: 감기 조심하고!
en_us: be careful not to catch a cold!

source: 으음, 여기서 바로 말 할 순 없고...
en_us: um, I can’t tell you here...

source: 내가 생각한 것보다 훨씬 섬세하고…
en_us: ...more attentive and friendly...

source: 만화 뿐만 아니라 게임도 엄청 재밌어!
en_us: not just the anime, but even the game is awesome!

source: 저 왔어요!
en_us: I’m here!

source: 요즘 너 변한 거 같아서.
en_us: you’ve changed recently.

source: 윤시아 녀석…
en_us: sia yoon...

source: 체지방량
en_us: Body Fat lbs

source: 젠장, 애니메이션 속으로 들어가고 싶다...!
en_us: dammit! I want to live inside that world!

source: 난 뉴튜버고, 셀럽인데!
en_us: I’m a newtuber! a celebrity!

source: 해치웠다!!
en_us: she beat it!!!

source: 역시… <노래방>일까나?
en_us: probably... karaoke.

source: 제목은 <여자친구에게 헤어지자고 해봤습니다> 뭐 이런 건가?
en_us: are you going to call it “I broke up with my girlfriend (candid camera)” or something?

source: 랑 ??
en_us: R ??

source: 마법소녀물이었어!?
en_us: she was a magical girl?!

source: 자, 그럼...
en_us: well, then...

source: 생각보다 재미있을지도!?
en_us: ...is more fun than I thought!

source: <방학식>
en_us: Winter Vacation

source: 아직도 그 게임 해…?
en_us: you still play that game?

source: 새우통면 BIG 찐라면 마일드 참치
en_us: Shrimp Noodles BIG Spicy Noodles Real Tuna

source: 콰르릉
en_us: RUMBLE

source: 이름하여 내 냄찬 킹카 만들기 프로젝트!
en_us: a.k.a. my dud to stud boyfriend project!

source: 사과가 너무 무성의한 거 아니야?
en_us: you call that an apology?!

source: 약
en_us: PHARMACY

source: 예전에는 몰랐는데,
en_us: I didn’t notice before...

source: rang.to** 우와 대박
en_us: rang.to** whoa amazing

source: 심지어 그 여자애들 우리 반 일진들이라구…!!
en_us: yeah! and those girls are bullies in our class!!!

source: 찰칵!
en_us: FLASH

source: 시끌
en_us: HUBBUB

source: 헉, 헉…
en_us: huff, huff...

source: 누가 막 들어오래!
en_us: and who said you could just barge in?!

source: 김민호다!!
en_us: it’s minho kim!!!

source: 보고싶었어!
en_us: I missed you!

source: 코찔찔이 김민호!!!
en_us: snot-face minho!!!

source: 아이고~ 오늘 간만에 설거짓 거리 많이 나왔네~
en_us: wow, there are a lot of dishes today!

source: 히익~~
en_us: GASP

source: 에...?
en_us: huh?

source: 나도 곧 50만인데 그럼 우리 동급인가!?
en_us: I’ll hit half a million soon as well. then does that mean we’ll be on the same level?

source: 시작한다...!!!
en_us: we’re starting now!!!

source: 나..나니?!
en_us: n-nani?!

source: 하여간 민하 너한테 말해서 잠복근무하길 잘 했어.
en_us: ha... it’s a good thing I asked you for help and stayed here with you, minha.

source: 맞아, 확실히…
en_us: yeah, definitely...

source: 자, 들어가자~
en_us: so... let’s go inside!

source: 나의 마음을 채워줄 수 있는 건 나코짱밖에 없다구!
en_us: nako-chan’s the only one who can make my heart whole!

source: 내 남친 킹카 만들기
en_us: Boyfriend Makeover

source: 데이트라고 칠 거면 환불해 환불!!
en_us: take it back! let’s go get a refund!!!

source: 얼굴이 아직 동그래서 그런가…
en_us: maybe it’s because his face is round...

source: 빨리 라면이라도 끓여 먹어야...!
en_us: I need some instant noodles right now!

source: 히익
en_us: GASP

source: 고마워.
en_us: thanks.

source: 그 이후로 성환쿤이랑 매일 만화카페도 가고, 만화 행사도 함께 다니곤 했어 ㅎㅎ !
en_us: since then, seonghwan-kun and I went to manga cafes every day. we attended anime conferences together too! hehe.

source: 생크림이 듬뿍 들어간 와플이랑
en_us: waffles topped with tons of whipped cream!

source: 360도
en_us: 360º

source: 나, 나도 뭐라도 해야 돼!!
en_us: I-I should do something too!

source: 어머~ 시아야~~ 안됐다~~~
en_us: oh no! poor sia!

source: 오늘 결과도 민호한테 비밀이야!
en_us: keep these results a secret from minho, okay?

source: 성환쿤 멋있지!!
en_us: isn’t seonghwan-kun great?!

source: 헤헤 안녕하세요~
en_us: hehe, hello!

source: 예전부터 이름이 맘에 들지 않는다며 동생처럼 바꿔달라고 조르더니,
en_us: she never really liked her name and wanted to change it to something like her brother’s.

source: 내가 시험기간엔 영상찍지 말자고 했잖아.
en_us: I thought we agreed not to film during midterms.

source: 어릴 때 우리집에 자주 놀러오곤 했으니…
en_us: he came over often when we were young anyway.

source: 절대 금지
en_us: PROHIBITED

source: 훨씬 멋있고 큰 집으로 이사 갈 거라고!
en_us: ...can move to a bigger, nicer house!

source: 그래, 그래~
en_us: okay, okay.

source: 후훗, 그게 뭐냐면...
en_us: hehe! it means...

source: 겁이 났다.
en_us: it scares me.

source: 민하야...!
en_us: minha!

source: 잘 해낼 수 있을 수도 있겠다고.
en_us: ...this might work out really well.

source: 날 뭘로 보고!!!
en_us: what do you take me for?!!!

source: 어어!
en_us: ugh, yeah!

source: 개성 만점,
en_us: stylish and trendy...

source: 바베큐
en_us: BBQ

source: 한스 헐 시아언니ㅠㅠㅠ
en_us: Hans whoa! siaaa!!!

source: 어째서 <다크 민호 모-드>가 되어버린 거냐구!!!!!
en_us: and why are you suddenly in dark minho mode?!!!!

source: 잊지마!!
en_us: don’t forget that!!!

source: 수군 수군
en_us: WHISPER WHISPER

source: 어...
en_us: uh...

source: 크하
en_us: WHOA

source: 너 조회수 개떡상 할 수도 있어.
en_us: it’ll give you tons of new views.

source: 하필이면 이런 천상계 인싸를...!!
en_us: how in the world did that guy... meet this angel from the in-crowd?!

source: 다들 좋은 곳으로 놀러 갔네...
en_us: they all went vacationing somewhere...

source: 저번 검사보다 4kg나 더 빠졌네~
en_us: you weigh nine pounds less than last time!

source: 헉!
en_us: GASP

source: 혼자 운동하지 않는다는 것.
en_us: ...no longer exercised alone.

source: 자, 잠깐...!!
en_us: w-wait!!

source: 시원이가 벌써 등교준비를 마쳤나봐요.
en_us: siwon must be here already.

source: 전보다 얼굴에 생기가 돌고,
en_us: ...his face actually has some color now.

source: 542 게시물 32.3만 팔로워
en_us: 542 Posts 323K Followers

source: 나 지금 부촌역 근처인데...
en_us: I’m near bu-chon station right now...

source: 뭐, 뭐라고!?
en_us: wh-what?!

source: 이름 개구려 ㅋㅋ
en_us: what a terrible title, ha

source: 뭐어어어!!??
en_us: whaaat?!!!

source: 시아의 말대로 하게 되면 난 어떻게 되는 거지...
en_us: do as sia says, what will happen to me?

source: 그 때 매점에서...!
en_us: ...the ones from the store!

source: 오늘의 민호는 설렘 MAX!!
en_us: today, minho was extremely excited!!!

source: 탁 탁
en_us: TRUDGE TRUDGE

source: 꺄아아~
en_us: KYAHHH

source: 배고파서 죽을 것 같은데….
en_us: I’m starving...

source: 김민호 사람만들기 프로젝트에 투자한 셈치면 안 아까워…
en_us: and I’ll just think of it as an investment for minho’s dud to stud makeover project...

source: 아마도…
en_us: I hope...

source: 이제 정말 얼마 안 남았으니 빡세게 관리 들어가야지.
en_us: he really doesn’t have much time left, so we need to follow a tight routine.

source: 네가 꽃분이 친구구나, 반갑다!!
en_us: you must be daisy’s friend! nice to meet you!!!

source: 또 저 놈들이 괴롭히면 말해~
en_us: tell me if they ever bully you again!

source: 왜...?
en_us: why?

source: 그나저나…
en_us: now...

source: 보고싶었다구우-!!!
en_us: I missed youuu!!!

source: 덕분에 이상한 자신감도 생겼지만...
en_us: he also gained a strange sense of confidence as well...

source: 비만 분석
en_us: Fat Analysis

source: 쪼르르
en_us: DASH

source: 이번에 운동 프로그램 새로 짠 거 알지?
en_us: you know I made him a new workout program, right?

source: ㅁ ㅗㅜ
en_us: jkl mno

source: 전에 메이크업 영상 하나 올렸다가 욕 호되게 먹은 건 기억 안 나?
en_us: don’t you remember all the negative comments you got on your first makeup video?

source: 히익!!
en_us: GASP

source: 진안은행
en_us: Jin An Bank

source: 믿고있었다구우우~~!!!
en_us: I believe youuuuu!!!

source: 걸그룹 얘기하는 거 아니었어?
en_us: weren’t you talking about a girl group?

source: 왜...
en_us: at this hour...?

source: 만신쿤의 다이어트 방법은 나한테 너무 착해…
en_us: mansik-kun’s dieting routine is too lax for me...

source: 두드려 맞고만 왔다고 자랑하게?
en_us: am I supposed to brag that I got beat up or what?

source: 크윽
en_us: GRIT

source: 태권도 신동이고 뭐고 다음엔 절대 안 봐줄 거임ㅋㅋ
en_us: taekwondo prodigy my foot. I’m not gonna let her off so easily next time!

source: 오늘따라 사진이 잘 나올 것만 같았다구...!!!
en_us: I thought it would come out great today!!!

source: 그랬던 지금의 난…
en_us: come to think of it...

source: 풉!
en_us: PFFT

source: 팍!
en_us: SNATCH

source: 108kg...!
en_us: 240 pounds?!

source: 폐점정리
en_us: CLEARANCE SALE

source: 유, 무산소 운동을 복합적으로 배치해 쉼 없이 수행하는 운동법
en_us: a combination of aerobic and anaerobic exercises performed with little rest between them

source: 앙!
en_us: HUP

source: 너희 집이랑도 가깝고 그러니까~
en_us: it’s close to your place.

source: 훈훈한 초딩 김민호였다는 거니까...
en_us: ...is the handsome minho from elementary school.

source: 친구나 괴롭히고 뭐 하는 거야!!!
en_us: ...instead of doing your homework?!!!

source: 두둥
en_us: DA DUN

source: 잘생긴 사람만 사귄다구.
en_us: I only date good-looking guys.

source: 뒤를 돌아봐~
en_us: look around~

source: 내가 이렇게 될 줄 알았어...
en_us: I knew this would happen...

source: 재미있을 것 같기도 하고...
en_us: ...I think it’ll be fun.

source: 일반적으론 안 쓰는 말투긴 하지…?
en_us: it isn’t normally how people talk...

source: 맞아!
en_us: yup!

source: 생각보다 잘 따라주고 있어.
en_us: you followed along much better than I expected.

source: 청춘
en_us: Gym o

source: 도대체 우리 시아가 뭐가 부족해서 차인 거야!!
en_us: why? how could anyone dump my perfect sia?!

source: 으음, 그렇구만...
en_us: hmmm, I see...

source: 앗, 안 해용~ ㅠㅠ ㅎ
en_us: oh, no thank you. hehe, sorry

source: 몽실몽실
en_us: Fluffy Fluffy

source: 그러냐…
en_us: I see...

source: 붕어빵 삼천원치 주세요~
en_us: I’d like three dollars’ worth of bungeo-ppang*, please. *a fish shaped pastry usually stuffed with sweet red bean paste

source: 목표 체중에는 잠깐 신경 끄고, 생활 습관을 유지하는 것만 1순위로 생각해!!
en_us: let’s not worry about a weight goal yet. your top priority right now is to maintain these new habits!!!

source: 헬스장이었잖아!?
en_us: but it’s a gym!!!

source: 극한의 다이어트를 시작했다.
en_us: it was an extreme diet.

source: 분명 변함없이 운동하고… 변함없이 식단까지 했는데…
en_us: I stuck with my normal exercise routine and meal plan... without changing a thing...

source: 으앙
en_us: WAAAH

source: 너무 먹고 싶잖아!
en_us: I really want some!

source: 이건 우리 둘만의 약속이었다고!!
en_us: it was supposed to be just you and me!!!

source: 우왕...
en_us: wow...

source: 나랑 뉴튜브 찍자
en_us: Let’s NewTube TOGETHER!

source: 윤시아 새남친?
en_us: sia yoon’s new boyfriend?

source: 벌떡
en_us: STAND

source: 아, 아니 시원아...
en_us: w-wait, siwon...

source: 그리고...
en_us: and...

source: 완벽한 작전인 만큼 고통과 수모가 뒤따를 것이라구!!!
en_us: it may be the perfect plan, but you will have to face suffering and humiliation!!!

source: ㅋ
en_us: HAHA

source: 만식이가 짱 멋있어 보여!!!
en_us: ...mansik looks so cool!!!

source: 오예~ 너무 잘 됐다, 그치!!?
en_us: yes! this is great, right?!!!

source: 최선의 옷을 찾아야 해!!!!
en_us: I have the find the best clothes!!!!

source: 촛토 마떼!!
en_us: chotto matte (wait a second)!!!

source: 우리 여태 좋았잖아...!!
en_us: we haven’t had any problems!!!

source: 평생 관리한다 생각하고 해야지.
en_us: ...he needs to think of it as if he’ll manage his weight for the rest of his life.

source: 헉…허억…헉…
en_us: huff... gasp... huff...

source: 하지만 분명 쉽지는 않을 거다!!!!
en_us: but be warned, it won’t be easy!!!!

source: 처가댁 백김치
en_us: White Kimchi

source: 그, 그야 당연하지!
en_us: o-of course you will!

source: 흠흠…
en_us: AHEM

source: 헐 추억이다..
en_us: omg memories...

source: 8화
en_us: Episode 8

source: 나코나코 나이토 휘-바- (나코 나코 나이트 피버)
en_us: nako-nako naito fui-ba- (nako-nako night fever)

source: 시, 시아쨩!
en_us: s-sia-chan!

source: (안 괜찮음)
en_us: (not okay)

source: 야매로오오...
en_us: yamerooo...

source: 알렉스라는 채널명으로 활동하고 있는 뷰티 뉴튜버로,
en_us: ...is a beauty newtuber who goes by the name alex on his channel.

source: 뷰티 뉴튜버야!
en_us: ...they’re a beauty newtuber!

source: 군필여고생
en_us: Military High Schooler

source: Pring 촹슬 새 깜
en_us: Chips Soju CRA ERS

source: (사실 찍어보고 싶었음)
en_us: (honestly, he just wanted to take one)

source: 오빠, 뭐 해!
en_us: minho! come on!

source: 으음, 너 초코소라빵이랑 또 뭐 먹을래?
en_us: hmmm... what else do you want? other than the chocolate pastry.

source: 별 거 없어, 시아쨩~
en_us: there isn’t much to it, sia-chan.

source: 너무 멋있어, 역시 성환쿤-!!
en_us: seonghwan-kun! you’re so awesome!!!

source: 우와, 10층인 건 예상했는데...
en_us: wow... I knew you’d be at the triple digits,

source: 세상이 미쳤거나,
en_us: either the world’s gone mad...

source: 나 과즙상으로 유명하잖아!!
en_us: I’m famous for having an adorable face, after all!

source: 진짜 진짜 나쁘지 않은데…
en_us: that really isn’t bad at all...

source: 헤헤
en_us: HEHE

source: 끄덕
en_us: NOD

source: 으으...
en_us: owww...

source: 저 둘이 잘 되든 말든 나는 이제 상관 없는 사람이라구...
en_us: whether they start dating or not doesn’t concern me.

source: 여태 새벽 중에 있었던 일들이 전부 기억이 안 난다...?
en_us: ...you don’t remember anything that happened in the middle of the night?

source: 나도 많이 죽었네, 이런 찐따한테 무시나 당하고.
en_us: I can’t believe even a loser like you is patronizing me.

source: 전혀 아닌데…
en_us: but it isn’t awful here at all...

source: 홍진아
en_us: Jina Hong

source: 바이
en_us: bye

source: 비슷한 애들끼리 친하게 지내는구나.
en_us: birds of a feather flock together.

source: 그런데 자기 이름을 검색해보라고 했다고?
en_us: anyway, she told you to look up her name online?

source: 그것도 언니가요!?
en_us: and you’re doing it, daisy?!

source: 넌 아직 화장 안해도 예쁜 나이인데...
en_us: You’re pretty enough without makeup...

source: 혹시 시야쨩… 내가 이런 말투 쓰는 게 싫었어…?
en_us: uh... sia-chan... did you not like it... when I talked like this?

source: 제이유...
en_us: j.u...

source: 야, 가자.
en_us: let’s go, guys.

source: 아, 그래?
en_us: oh, really?

source: 내일?
en_us: tomorrow?

source: 마음대로 해~
en_us: sure, do whatever you’d like.

source: 핑-
en_us: PING

source: 나 피곤해, 잘래...
en_us: I’m so tired I’d rather sleep...

source: 말 나온 김에 집가서 큐브 몬스터 게임도 해야겠다!!
en_us: now that I mentioned it, I should play the cube monster game too!!!

source: 내가 오늘 김민호 사람 만들고 만다!!!
en_us: I’ll make a man out of minho today, no matter what!!!

source: 우, 우와...
en_us: wh-whoa...

source: 나...
en_us: I think...

source: 헐 중대소식??!
en_us: an important announcement??!

source: 뭐, 뭐지…
en_us: wh-what’s going on?

source: 시아는 어떻게 이름을 바꾸게 된 거예요?
en_us: why did sia change her name?

source: 죄송..합니..ㄷ
en_us: I’m... really... sor

source: 2년 사귄 남자친구랑 헤어졌다면서 셀카 올릴 정신도 있고.
en_us: you say you broke up with your boyfriend of two years but still post smiley selfies on social media without a problem, huh?

source: 저러다 애 잡겠어!
en_us: what if that kid gets hurt badly?

source: 고등학생이 되면서 키가 왕창 크더니 덩치도 불었어.
en_us: I suddenly grew taller and bigger in high school.

source: 벌컥
en_us: FLING

source: 왜 그 생각을 못 했지?!
en_us: why didn’t I think of it sooner?!

source: 와악!
en_us: BELLOW

source: 민호킁의 특제 짜장라면!!!
en_us: minho-kun’s special black bean noodles!!!

source: 난 이녀석을 꼭
en_us: I’m going to...

source: 이제 내가 만만한가!?
en_us: do they think I’m a pushover now or what?

source: 너 아직 100만 조회수 없지?
en_us: you don’t have a vid with a million views yet, right?

source: 피부 트러블도 너무 선명하게 보이고...
en_us: and my acne is so obvious...

source: 닭가슴살
en_us: Chicken Breast

source: 들썩 들썩
en_us: BOUNCE BOUNCE

source: 학원!?
en_us: academy?!

source: 자, 일주일 동안 고생 많았따, 김민호!
en_us: good work last week, minho!

source: 일단 일어서!
en_us: stand up!

source: 알렉스의 나이트케어 루틴
en_us: Alex’s Nighttime Skincare Routine

source: 그런데…아까 노래방에서 무슨 일 있엇어?
en_us: but... did something happen back at the karaoke?

source: 못 알아볼 뻔 했어요!!!
en_us: I almost didn’t recognize you!!!

source: 빨리 봄이 왔으면 좋겠어.
en_us: I can’t wait for spring to come!

source: 이번 주말에
en_us: this weekend!

source: 제일 큰일은...
en_us: but the bigger problem...

source: 잘생겨따...
en_us: he’s so handsome...

source: 백시원이 예전처럼 웃으며 날 맞아주기를...
en_us: ...that he will be waiting for me like before with a big smile.

source: 체중 98 kg
en_us: Weight 216 lbs

source: 구리 구리
en_us: STINKY STINKY

source: 마치 사회인이 된 듯한 기분이 드는 걸?
en_us: ...makes me feel like I’m a member of society!

source: 초등학교 때부터 지금까지 쭉 라이벌이었던 강보배는...
en_us: bobae has been my rival since elementary school until now.

source: 에휴 됐다 됐어, 다른 건 나중에 생각해.
en_us: haha, fine, fine. anyway, let’s think about the videos later.

source: 2개 이상
en_us: 2 more

source: 3,205개 댓글 101개 공유
en_us: 3,205 101 comments Share

source: 이게 얼마만의 외출이냐~!!
en_us: how long has it been since I last went out like this?

source: 아~ 그 윤시아 채널에 김민호?
en_us: oh! minho kim from sia yoon’s channel?

source: 어머~ 시아야~
en_us: oh, sia!

source: 저거 직어서 보배 보여줄까?
en_us: let’s film them and show bobae! haha.

source: 얼굴은 분명 그 아이가 맞는데...
en_us: she definitely had that girl’s face...

source: 이런 관심...
en_us: this kind of attention...

source: 쯧.
en_us: geez.

source: 긁적
en_us: SCRATCH

source: 나락
en_us: EXPOSED

source: 허허…
en_us: haha

source: 오후 9:34
en_us: 9:34 PM

source: 하늘이 내 소원을 들어줬어!!
en_us: god answered my prayers!!!

source: 가자, 응?
en_us: so, let’s go!

source: 민호와 운동을 시작한 지 벌써 이주째,
en_us: two weeks have passed since sia started working out with minho.

source: 이, 이렇게 바로!?
en_us: r-right now?!

source: 1년 동안 정말 고생 많았다,
en_us: you’ve all worked hard this last year.

source: 끼요옷!!
en_us: squeee!!!

source: 띵동
en_us: DING DONG

source: 걸그룹 덕후
en_us: fanboy of a kpop girl group

source: 내 눈이 얼마나 높은데!
en_us: don’t you know how high my standards are?!

source: 게다가 내 첫사랑같아...
en_us: and I think she’s my first love, at that...

source: 오예~ 뉴튭각이다!
en_us: yes! it’ll come out great for the video!

source: 쿵
en_us: SLAM

source: 그런 거 아니라고~!!
en_us: I told you, we’re not dating!!!

source: 선생님 부를까?
en_us: should we get a teacher?

source: 시아에게 말 했다가 되려 혼나고 말 거야...!!!
en_us: if I tell her, she might yell at me!!!

source: 통깨라면
en_us: Sesame Noodles

source: 응...?
en_us: huh?

source: 야!
en_us: hey!

source: 어쩔 수 없어, 시간이 얼마 안 남았잖아!
en_us: we don’t have a choice. there isn’t much time!

source: 처음 이 콘텐츠를 하려고 했을 땐, 마음이 이정도까지 불편할 줄은 몰랐어.
en_us: when I first started this project, I didn’t think I’d feel this uncomfortable about it.

source: 네가 원하는 모습에 분명 더 가까워질 수 있을 거야
en_us: ...you’ll definitely get closer to where you want to be.

source: 누나, 걍 인정해~
en_us: sia, just admit it.

source: 아아~ 담배 쩐내나~
en_us: ...reek of cigarettes! ewww!

source: ...라는 콘텐츠까지 준비 했었는데!!!
en_us: that was the content I had prepared for the channel!

source: 민호님 열심히 하시네~
en_us: minho’s really working out hard!

source: 3주 만에 10kg 감량에 성공했다.
en_us: ...lost more than 20 pounds in three weeks.

source: 꽃분이 엄마도 함께 했다면 더 좋았을텐데…
en_us: it would have been nice if daisy’s mother was here with us...

source: 어떡해!!
en_us: oh, gosh!!!

source: 운동회 하면 나는 늘 달리기 꼴등이었는데, 시아쨩은 매일 1등하고!
en_us: whenever we had track meets, I came in last in every race. but you came in first all the time!

source: 현재음정 여성Db 원음정 여성Db
en_us: Current key: Female Db Original key: Female Db

source: 운동 휴식
en_us: Workout Rest

source: 저 왔어요~
en_us: I’m here!

source: 김민성신경과정신과의원
en_us: MINSEONG KIM PSYCHIATRY

source: 스키…장?!
en_us: ski...ing?!

source: 왔어?
en_us: hey!

source: 이건 언제 고치냐…
en_us: will you ever stop calling me that?

source: 툭!
en_us: SHOVE

source: 난 여태 꾸준히 잘 해왔으니까~
en_us: I’ve been consistently exercising until now too.

source: 육교장 CUP 육교장 CUP
en_us: CUP Beef Noodles CUP Beef Noodles

source: 찡긋
en_us: FROWN

source: 우리반 남자애들은 이제 지겹단 말이에요!!
en_us: I’m so sick of all the other boys!

source: 민호킁은 혼자가 아니니까...!!
en_us: you’re not alone. I’m here for you!!!

source: 너 오늘 데이트 안 가냐?
en_us: ...aren’t you going out on a date today?

source: 응!
en_us: okay!

source: 김민호가 가장 좋아하는 것.
en_us: ...what minho likes best.

source: 이제 이 한 컷만 더 채우면 돼~
en_us: one more cut to fill~

source: 그건 잘 모르겠고...
en_us: I don’t know about that...

source: 서로 선물도 교환했잖아!!!
en_us: we bought each other gifts too!!!

source: 곧 있으면...
en_us: soon...

source: 구독자들한테 또 뭐라고 말 해야 할지 모르겠어...
en_us: what am I supposed to say to my subscribers?

source: 가 기 고
en_us: X Y Z

source: 우와!!
en_us: wow!!!

source: 꾸벅
en_us: BOW

source: 치킨 반 마리도 못 먹는게 무슨...
en_us: you can’t even finish half of a chicken...

source: ㅋㅋㅋㅋㅋㅋ
en_us: HEHEHEHE

source: 그, 그만..!!
en_us: n-no...

source: 두 번째 체중검사의 날이 왔다.
en_us: ...it was time for minho’s second weigh-in.

source: 벌레랑 뒹굴기 싫으면 예성이말 잘 들어!!!
en_us: you’d better listen to yeseong if you don’t want that bug in your clothes!!!

source: 반드시!
en_us: no matter what!

source: 마지막은 예의바른 남자가 되는 것이다.
en_us: and finally, be a well-mannered man.

source: 뭐~ 그런 게 아니라면
en_us: well, if there isn’t any reason...

source: 겉으로 봤을 땐 티가 별로 안 나지만...
en_us: although I can’t tell just from looking at him...

source: 배고ㅍ...
en_us: I’m hungr...

source: 헉 헉 헉
en_us: HUFF HUFF HUFF

source: 부끄
en_us: EMBARRASSED

source: 돈으로 안 되는 건 없어!!!
en_us: you can do anything with money!!!

source: 난 너 사람 마음 가지고 콘텐츠 써먹는 소시오패스인줄~
en_us: I almost thought you were an insensitive person who used people’s feelings to boost your channel.

source: 으...
en_us: UGH

source: 익명 19
en_us: Anonymous 19

source: 그치?
en_us: right?

source: 살이 더 이상 빠지지 않는 이유는 오히려…
en_us: ...but the reason why you’re not losing any more weight...

source: 물론, 예전 식단보다 훨씬 할만하다구.
en_us: of course! it’s a lot more doable than the first one!

source: 각자 부르고 싶은 노래를 하나씩 예약해 차례를 지켜 부르는 것이 매너란 말이다!
en_us: it’s proper etiquette to take turns reserving a song and singing them, one at a time!

source: 쁘이-
en_us: cheese-

source: 아냐,
en_us: no, wait.

source: 저, 저기 그럼…!!!
en_us: th-then!!!

source: 점심 고구마 1개 닭가슴살 샐러드
en_us: Lunch 1 sweet potato Chicken breast salad

source: 프로젝트...
en_us: I... wasn’t sure

source: 짹짹
en_us: CHIRP CHIRP

source: 욕 먹을 건 예상하고 시작한 프로젝트니까 상관 없어.
en_us: it doesn’t matter. I started the project expecting some level of criticism.

source: 1.2천
en_us: 1.2K
